Саракташ2/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>Анонимный</name>
      <description>Анонимный</description>
    </items>
  </predefined>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Розница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <comment>ОГРН для неиностранных контрагентов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочтенияВИзделиях</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТранспортнаяКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоТелефону</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресуЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоЮрЛицо = Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮридическоеЛицо");
	Элементы.КодПоОКПО.Видимость = ЭтоЮрЛицо;
	Элементы.КПП.Видимость = ЭтоЮрЛицо;
	Элементы.РегистрационныйНомер.Видимость = ЭтоЮрЛицо;
	Элементы.СвидетельствоДатаВыдачи.Видимость = ЭтоЮрЛицо;
	Элементы.СвидетельствоСерияНомер.Видимость = ЭтоЮрЛицо;
	
	Элементы.СтраницаДополнительно.Видимость = Объект.Покупатель И Объект.Опт;  	
	Элементы.ГруппаФлагиКонтрагента.Видимость = Не Объект.ЭтоТранспортнаяКомпания;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮридическоеЛицо");
		КонтактныеЛица.Параметры.УстановитьЗначениеПараметра("Контрагент", NULL);
	Иначе
		КонтактныеЛица.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Ключ);
	КонецЕсли;
	
	Если Объект.Опт Тогда 
		Заказы.Параметры.УстановитьЗначениеПараметра("Контрагент", Объект.Ссылка);
		Элементы.ГруппаЗаказы.Видимость = Истина;
	Иначе
		Элементы.ГруппаЗаказы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();  
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтактноеЛицо(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Контрагента необходимо записать!",15);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Контрагент", Объект.Ссылка);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонтактноеЛицо(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Контрагента необходимо записать!",15);
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.КонтактныеЛица.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПометкуУдаленияУКонтактногоЛица(ТекДанные.Ссылка);
	Элементы.КонтактныеЛица.Обновить(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуУдаленияУКонтактногоЛица(Знач Ссылка)
	
	Об = Ссылка.ПолучитьОбъект();
	Об.ПометкаУдаления = Истина;
	Об.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьКонтактногоЛица" Тогда
		Элементы.КонтактныеЛица.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоТранспортнаяКомпанияПриИзменении(Элемент)
	
	Если Объект.ЭтоТранспортнаяКомпания Тогда
		Объект.Покупатель = Ложь;
		Объект.Поставщик = Истина;
		Объект.Опт = Ложь;
		Объект.Розница = Ложь;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыЗаказНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элементы.Заказы.ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыПередНачаломИзменения(Элемент, Отказ)
	ОткрытьЗначение(Элементы.Заказы.ТекущиеДанные.Заказ);
КонецПроцедуры


&НаКлиенте
Процедура КонтактнаяИнформацияПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.КонтактнаяИнформация.ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	Попытка
		
		Если Элементы.КонтактнаяИнформация.ТекущиеДанные <> Неопределено
			И Элементы.КонтактнаяИнформация.ТекущиеДанные.Тип = ПолныеПрава.ПолучитьПеречисление("ТипыКонтактнойИнформации", "Отправитель") Тогда
			Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Истина;
			Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить("");
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить("Захаров");
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить("Уваров");
		Иначе
			Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Ложь;
			Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры
